codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mz1024efk124.h
extern volatile __CNPUHbits_t CNPUHbits __asm__ ("CNPUH") __attribute__((section("sfrs")));
extern volatile unsigned int        CNPUHCLR __attribute__((section("sfrs")));
extern volatile unsigned int        CNPUHSET __attribute__((section("sfrs")));
extern volatile unsigned int        CNPUHINV __attribute__((section("sfrs")));
extern volatile unsigned int        CNPDH __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned CNPDH0:1;
    unsigned CNPDH1:1;
    unsigned :2;
    unsigned CNPDH4:1;
    unsigned CNPDH5:1;
    unsigned CNPDH6:1;
    unsigned :1;
    unsigned CNPDH8:1;
    unsigned CNPDH9:1;
    unsigned CNPDH10:1;
    unsigned :1;
    unsigned CNPDH12:1;
    unsigned CNPDH13:1;
  };
  struct {
    unsigned w:32;
  };
} __CNPDHbits_t;
extern volatile __CNPDHbits_t CNPDHbits __asm__ ("CNPDH") __attribute__((section("sfrs")));
extern volatile unsigned int        CNPDHCLR __attribute__((section("sfrs")));
extern volatile unsigned int        CNPDHSET __attribute__((section("sfrs")));
extern volatile unsigned int        CNPDHINV __attribute__((section("sfrs")));
extern volatile unsigned int        CNCONH __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned :11;
    unsigned EDGEDETECT:1;
    unsigned :1;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned w:32;
  };
} __CNCONHbits_t;
extern volatile __CNCONHbits_t CNCONHbits __asm__ ("CNCONH") __attribute__((section("sfrs")));
extern volatile unsigned int        CNCONHCLR __attribute__((section("sfrs")));
extern volatile unsigned int        CNCONHSET __attribute__((section("sfrs")));
extern volatile unsigned int        CNCONHINV __attribute__((section("sfrs")));
extern volatile unsigned int        CNENH __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned CNIEH0:1;
    unsigned CNIEH1:1;
    unsigned :2;
    unsigned CNIEH4:1;
    unsigned CNIEH5:1;
    unsigned CNIEH6:1;
    unsigned :1;
    unsigned CNIEH8:1;
    unsigned CNIEH9:1;
    unsigned CNIEH10:1;
    unsigned :1;
    unsigned CNIEH12:1;
    unsigned CNIEH13:1;
  };
  struct {
    unsigned w:32;
  };
} __CNENHbits_t;
extern volatile __CNENHbits_t CNENHbits __asm__ ("CNENH") __attribute__((section("sfrs")));
extern volatile unsigned int        CNENHCLR __attribute__((section("sfrs")));
extern volatile unsigned int        CNENHSET __attribute__((section("sfrs")));
extern volatile unsigned int        CNENHINV __attribute__((section("sfrs")));
extern volatile unsigned int        CNSTATH __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned CNSTATH0:1;
    unsigned CNSTATH1:1;
    unsigned :2;
    unsigned CNSTATH4:1;
    unsigned CNSTATH5:1;
    unsigned CNSTATH6:1;
    unsigned :1;
    unsigned CNSTATH8:1;
    unsigned CNSTATH9:1;
    unsigned CNSTATH10:1;
    unsigned :1;
    unsigned CNSTATH12:1;
    unsigned CNSTATH13:1;
  };
  struct {
    unsigned w:32;
  };
} __CNSTATHbits_t;
extern volatile __CNSTATHbits_t CNSTATHbits __asm__ ("CNSTATH") __attribute__((section("sfrs")));
extern volatile unsigned int        CNSTATHCLR __attribute__((section("sfrs")));
extern volatile unsigned int        CNSTATHSET __attribute__((section("sfrs")));
extern volatile unsigned int        CNSTATHINV __attribute__((section("sfrs")));
extern volatile unsigned int        CNNEH __attribute__((section("sfrs")));
typedef struct {
  unsigned CNNEH0:1;
  unsigned CNNEH1:1;
  unsigned :2;
  unsigned CNNEH4:1;
  unsigned CNNEH5:1;
  unsigned CNNEH6:1;
  unsigned :1;
  unsigned CNNEH8:1;
  unsigned CNNEH9:1;
  unsigned CNNEH10:1;
  unsigned :1;
  unsigned CNNEH12:1;
  unsigned CNNEH13:1;
} __CNNEHbits_t;
extern volatile __CNNEHbits_t CNNEHbits __asm__ ("CNNEH") __attribute__((section("sfrs")));
extern volatile unsigned int        CNFH __attribute__((section("sfrs")));
typedef struct {
  unsigned CNFH0:1;
  unsigned CNFH1:1;
  unsigned :2;
  unsigned CNFH4:1;
  unsigned CNFH5:1;
  unsigned CNFH6:1;
  unsigned :1;
  unsigned CNFH8:1;
  unsigned CNFH9:1;
  unsigned CNFH10:1;
  unsigned :1;
  unsigned CNFH12:1;
  unsigned CNFH13:1;
} __CNFHbits_t;
extern volatile __CNFHbits_t CNFHbits __asm__ ("CNFH") __attribute__((section("sfrs")));
extern volatile unsigned int        ANSELJ __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned :8;
    unsigned ANSJ8:1;
    unsigned ANSJ9:1;
    unsigned :1;
    unsigned ANSJ11:1;
  };
  struct {
    unsigned w:32;
  };
} __ANSELJbits_t;
extern volatile __ANSELJbits_t ANSELJbits __asm__ ("ANSELJ") __attribute__((section("sfrs")));
extern volatile unsigned int        ANSELJCLR __attribute__((section("sfrs")));
extern volatile unsigned int        ANSELJSET __attribute__((section("sfrs")));
extern volatile unsigned int        ANSELJINV __attribute__((section("sfrs")));
extern volatile unsigned int        TRISJ __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned TRISJ0:1;
    unsigned TRISJ1:1;
    unsigned TRISJ2:1;
    unsigned :1;
    unsigned TRISJ4:1;
    unsigned :3;
    unsigned TRISJ8:1;
    unsigned TRISJ9:1;
    unsigned :1;
    unsigned TRISJ11:1;
  };
  struct {
    unsigned w:32;
  };
} __TRISJbits_t;
extern volatile __TRISJbits_t TRISJbits __asm__ ("TRISJ") __attribute__((section("sfrs")));
extern volatile unsigned int        TRISJCLR __attribute__((section("sfrs")));
extern volatile unsigned int        TRISJSET __attribute__((section("sfrs")));
extern volatile unsigned int        TRISJINV __attribute__((section("sfrs")));
extern volatile unsigned int        PORTJ __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned RJ0:1;
    unsigned RJ1:1;
    unsigned RJ2:1;
    unsigned :1;
    unsigned RJ4:1;
    unsigned :3;
    unsigned RJ8:1;
    unsigned RJ9:1;
    unsigned :1;
    unsigned RJ11:1;
  };
  struct {
    unsigned w:32;
  };
} __PORTJbits_t;
extern volatile __PORTJbits_t PORTJbits __asm__ ("PORTJ") __attribute__((section("sfrs")));
extern volatile unsigned int        PORTJCLR __attribute__((section("sfrs")));
extern volatile unsigned int        PORTJSET __attribute__((section("sfrs")));
extern volatile unsigned int        PORTJINV __attribute__((section("sfrs")));
extern volatile unsigned int        LATJ __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned LATJ0:1;
    unsigned LATJ1:1;
    unsigned LATJ2:1;
    unsigned :1;
    unsigned LATJ4:1;
    unsigned :3;
    unsigned LATJ8:1;
    unsigned LATJ9:1;
    unsigned :1;
    unsigned LATJ11:1;
  };
  struct {
    unsigned w:32;
  };
} __LATJbits_t;
extern volatile __LATJbits_t LATJbits __asm__ ("LATJ") __attribute__((section("sfrs")));
extern volatile unsigned int        LATJCLR __attribute__((section("sfrs")));
extern volatile unsigned int        LATJSET __attribute__((section("sfrs")));
extern volatile unsigned int        LATJINV __attribute__((section("sfrs")));
extern volatile unsigned int        ODCJ __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned ODCJ0:1;
    unsigned ODCJ1:1;
    unsigned ODCJ2:1;
    unsigned :1;
    unsigned ODCJ4:1;
    unsigned :3;
    unsigned ODCJ8:1;
    unsigned ODCJ9:1;
    unsigned :1;
    unsigned ODCJ11:1;
  };
  struct {
    unsigned w:32;
  };
} __ODCJbits_t;
extern volatile __ODCJbits_t ODCJbits __asm__ ("ODCJ") __attribute__((section("sfrs")));
extern volatile unsigned int        ODCJCLR __attribute__((section("sfrs")));
extern volatile unsigned int        ODCJSET __attribute__((section("sfrs")));
extern volatile unsigned int        ODCJINV __attribute__((section("sfrs")));
extern volatile unsigned int        CNPUJ __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned CNPUJ0:1;
    unsigned CNPUJ1:1;
    unsigned CNPUJ2:1;
    unsigned :1;
    unsigned CNPUJ4:1;
    unsigned :3;
    unsigned CNPUJ8:1;
    unsigned CNPUJ9:1;
    unsigned :1;
    unsigned CNPUJ11:1;
  };
  struct {
    unsigned w:32;
  };
} __CNPUJbits_t;
extern volatile __CNPUJbits_t CNPUJbits __asm__ ("CNPUJ") __attribute__((section("sfrs")));
extern volatile unsigned int        CNPUJCLR __attribute__((section("sfrs")));
extern volatile unsigned int        CNPUJSET __attribute__((section("sfrs")));
extern volatile unsigned int        CNPUJINV __attribute__((section("sfrs")));
extern volatile unsigned int        CNPDJ __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned CNPDJ0:1;
    unsigned CNPDJ1:1;
    unsigned CNPDJ2:1;
    unsigned :1;
    unsigned CNPDJ4:1;
    unsigned :3;
    unsigned CNPDJ8:1;
    unsigned CNPDJ9:1;
    unsigned :1;
    unsigned CNPDJ11:1;
  };
  struct {
    unsigned w:32;
  };
} __CNPDJbits_t;
