codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mz1024efk124.h
#define _U6STA_URXEN_POSITION                    0x0000000C
#define _U6STA_URXEN_MASK                        0x00001000
#define _U6STA_URXEN_LENGTH                      0x00000001

#define _U6STA_UTXINV_POSITION                   0x0000000D
#define _U6STA_UTXINV_MASK                       0x00002000
#define _U6STA_UTXINV_LENGTH                     0x00000001

#define _U6STA_UTXISEL_POSITION                  0x0000000E
#define _U6STA_UTXISEL_MASK                      0x0000C000
#define _U6STA_UTXISEL_LENGTH                    0x00000002

#define _U6STA_ADDR_POSITION                     0x00000010
#define _U6STA_ADDR_MASK                         0x00FF0000
#define _U6STA_ADDR_LENGTH                       0x00000008

#define _U6STA_ADM_EN_POSITION                   0x00000018
#define _U6STA_ADM_EN_MASK                       0x01000000
#define _U6STA_ADM_EN_LENGTH                     0x00000001

#define _U6STA_URXISEL0_POSITION                 0x00000006
#define _U6STA_URXISEL0_MASK                     0x00000040
#define _U6STA_URXISEL0_LENGTH                   0x00000001

#define _U6STA_URXISEL1_POSITION                 0x00000007
#define _U6STA_URXISEL1_MASK                     0x00000080
#define _U6STA_URXISEL1_LENGTH                   0x00000001

#define _U6STA_UTXISEL0_POSITION                 0x0000000E
#define _U6STA_UTXISEL0_MASK                     0x00004000
#define _U6STA_UTXISEL0_LENGTH                   0x00000001

#define _U6STA_UTXISEL1_POSITION                 0x0000000F
#define _U6STA_UTXISEL1_MASK                     0x00008000
#define _U6STA_UTXISEL1_LENGTH                   0x00000001

#define _U6STA_UTXSEL_POSITION                   0x0000000E
#define _U6STA_UTXSEL_MASK                       0x0000C000
#define _U6STA_UTXSEL_LENGTH                     0x00000002

#define _U6STA_w_POSITION                        0x00000000
#define _U6STA_w_MASK                            0xFFFFFFFF
#define _U6STA_w_LENGTH                          0x00000020

#define _ULMSTA_URXDA_POSITION                   0x00000000
#define _ULMSTA_URXDA_MASK                       0x00000001
#define _ULMSTA_URXDA_LENGTH                     0x00000001

#define _ULMSTA_OERR_POSITION                    0x00000001
#define _ULMSTA_OERR_MASK                        0x00000002
#define _ULMSTA_OERR_LENGTH                      0x00000001

#define _ULMSTA_FERR_POSITION                    0x00000002
#define _ULMSTA_FERR_MASK                        0x00000004
#define _ULMSTA_FERR_LENGTH                      0x00000001

#define _ULMSTA_PERR_POSITION                    0x00000003
#define _ULMSTA_PERR_MASK                        0x00000008
#define _ULMSTA_PERR_LENGTH                      0x00000001

#define _ULMSTA_RIDLE_POSITION                   0x00000004
#define _ULMSTA_RIDLE_MASK                       0x00000010
#define _ULMSTA_RIDLE_LENGTH                     0x00000001

#define _ULMSTA_ADDEN_POSITION                   0x00000005
#define _ULMSTA_ADDEN_MASK                       0x00000020
#define _ULMSTA_ADDEN_LENGTH                     0x00000001

#define _ULMSTA_URXISEL_POSITION                 0x00000006
#define _ULMSTA_URXISEL_MASK                     0x000000C0
#define _ULMSTA_URXISEL_LENGTH                   0x00000002

#define _ULMSTA_TRMT_POSITION                    0x00000008
#define _ULMSTA_TRMT_MASK                        0x00000100
#define _ULMSTA_TRMT_LENGTH                      0x00000001

#define _ULMSTA_UTXBF_POSITION                   0x00000009
#define _ULMSTA_UTXBF_MASK                       0x00000200
#define _ULMSTA_UTXBF_LENGTH                     0x00000001

#define _ULMSTA_UTXEN_POSITION                   0x0000000A
#define _ULMSTA_UTXEN_MASK                       0x00000400
#define _ULMSTA_UTXEN_LENGTH                     0x00000001

#define _ULMSTA_UTXBRK_POSITION                  0x0000000B
#define _ULMSTA_UTXBRK_MASK                      0x00000800
#define _ULMSTA_UTXBRK_LENGTH                    0x00000001

#define _ULMSTA_URXEN_POSITION                   0x0000000C
#define _ULMSTA_URXEN_MASK                       0x00001000
#define _ULMSTA_URXEN_LENGTH                     0x00000001

#define _ULMSTA_UTXINV_POSITION                  0x0000000D
#define _ULMSTA_UTXINV_MASK                      0x00002000
#define _ULMSTA_UTXINV_LENGTH                    0x00000001

#define _ULMSTA_UTXISEL_POSITION                 0x0000000E
#define _ULMSTA_UTXISEL_MASK                     0x0000C000
#define _ULMSTA_UTXISEL_LENGTH                   0x00000002

#define _ULMSTA_ADDR_POSITION                    0x00000010
#define _ULMSTA_ADDR_MASK                        0x00FF0000
#define _ULMSTA_ADDR_LENGTH                      0x00000008

#define _ULMSTA_ADM_EN_POSITION                  0x00000018
#define _ULMSTA_ADM_EN_MASK                      0x01000000
#define _ULMSTA_ADM_EN_LENGTH                    0x00000001

#define _ULMSTA_URXISEL0_POSITION                0x00000006
#define _ULMSTA_URXISEL0_MASK                    0x00000040
#define _ULMSTA_URXISEL0_LENGTH                  0x00000001

#define _ULMSTA_URXISEL1_POSITION                0x00000007
#define _ULMSTA_URXISEL1_MASK                    0x00000080
#define _ULMSTA_URXISEL1_LENGTH                  0x00000001

#define _ULMSTA_UTXISEL0_POSITION                0x0000000E
#define _ULMSTA_UTXISEL0_MASK                    0x00004000
#define _ULMSTA_UTXISEL0_LENGTH                  0x00000001

#define _ULMSTA_UTXISEL1_POSITION                0x0000000F
#define _ULMSTA_UTXISEL1_MASK                    0x00008000
#define _ULMSTA_UTXISEL1_LENGTH                  0x00000001

#define _ULMSTA_UTXSEL_POSITION                  0x0000000E
#define _ULMSTA_UTXSEL_MASK                      0x0000C000
#define _ULMSTA_UTXSEL_LENGTH                    0x00000002

#define _ULMSTA_w_POSITION                       0x00000000
#define _ULMSTA_w_MASK                           0xFFFFFFFF
#define _ULMSTA_w_LENGTH                         0x00000020

#define _PMCON_RDSP_POSITION                     0x00000000
#define _PMCON_RDSP_MASK                         0x00000001
#define _PMCON_RDSP_LENGTH                       0x00000001

#define _PMCON_WRSP_POSITION                     0x00000001
#define _PMCON_WRSP_MASK                         0x00000002
#define _PMCON_WRSP_LENGTH                       0x00000001

