codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mz1024efk124.h
#define _TRISJ_TRISJ8_POSITION                   0x00000008
#define _TRISJ_TRISJ8_MASK                       0x00000100
#define _TRISJ_TRISJ8_LENGTH                     0x00000001

#define _TRISJ_TRISJ9_POSITION                   0x00000009
#define _TRISJ_TRISJ9_MASK                       0x00000200
#define _TRISJ_TRISJ9_LENGTH                     0x00000001

#define _TRISJ_TRISJ11_POSITION                  0x0000000B
#define _TRISJ_TRISJ11_MASK                      0x00000800
#define _TRISJ_TRISJ11_LENGTH                    0x00000001

#define _TRISJ_w_POSITION                        0x00000000
#define _TRISJ_w_MASK                            0xFFFFFFFF
#define _TRISJ_w_LENGTH                          0x00000020

#define _PORTJ_RJ0_POSITION                      0x00000000
#define _PORTJ_RJ0_MASK                          0x00000001
#define _PORTJ_RJ0_LENGTH                        0x00000001

#define _PORTJ_RJ1_POSITION                      0x00000001
#define _PORTJ_RJ1_MASK                          0x00000002
#define _PORTJ_RJ1_LENGTH                        0x00000001

#define _PORTJ_RJ2_POSITION                      0x00000002
#define _PORTJ_RJ2_MASK                          0x00000004
#define _PORTJ_RJ2_LENGTH                        0x00000001

#define _PORTJ_RJ4_POSITION                      0x00000004
#define _PORTJ_RJ4_MASK                          0x00000010
#define _PORTJ_RJ4_LENGTH                        0x00000001

#define _PORTJ_RJ8_POSITION                      0x00000008
#define _PORTJ_RJ8_MASK                          0x00000100
#define _PORTJ_RJ8_LENGTH                        0x00000001

#define _PORTJ_RJ9_POSITION                      0x00000009
#define _PORTJ_RJ9_MASK                          0x00000200
#define _PORTJ_RJ9_LENGTH                        0x00000001

#define _PORTJ_RJ11_POSITION                     0x0000000B
#define _PORTJ_RJ11_MASK                         0x00000800
#define _PORTJ_RJ11_LENGTH                       0x00000001

#define _PORTJ_w_POSITION                        0x00000000
#define _PORTJ_w_MASK                            0xFFFFFFFF
#define _PORTJ_w_LENGTH                          0x00000020

#define _LATJ_LATJ0_POSITION                     0x00000000
#define _LATJ_LATJ0_MASK                         0x00000001
#define _LATJ_LATJ0_LENGTH                       0x00000001

#define _LATJ_LATJ1_POSITION                     0x00000001
#define _LATJ_LATJ1_MASK                         0x00000002
#define _LATJ_LATJ1_LENGTH                       0x00000001

#define _LATJ_LATJ2_POSITION                     0x00000002
#define _LATJ_LATJ2_MASK                         0x00000004
#define _LATJ_LATJ2_LENGTH                       0x00000001

#define _LATJ_LATJ4_POSITION                     0x00000004
#define _LATJ_LATJ4_MASK                         0x00000010
#define _LATJ_LATJ4_LENGTH                       0x00000001

#define _LATJ_LATJ8_POSITION                     0x00000008
#define _LATJ_LATJ8_MASK                         0x00000100
#define _LATJ_LATJ8_LENGTH                       0x00000001

#define _LATJ_LATJ9_POSITION                     0x00000009
#define _LATJ_LATJ9_MASK                         0x00000200
#define _LATJ_LATJ9_LENGTH                       0x00000001

#define _LATJ_LATJ11_POSITION                    0x0000000B
#define _LATJ_LATJ11_MASK                        0x00000800
#define _LATJ_LATJ11_LENGTH                      0x00000001

#define _LATJ_w_POSITION                         0x00000000
#define _LATJ_w_MASK                             0xFFFFFFFF
#define _LATJ_w_LENGTH                           0x00000020

#define _ODCJ_ODCJ0_POSITION                     0x00000000
#define _ODCJ_ODCJ0_MASK                         0x00000001
#define _ODCJ_ODCJ0_LENGTH                       0x00000001

#define _ODCJ_ODCJ1_POSITION                     0x00000001
#define _ODCJ_ODCJ1_MASK                         0x00000002
#define _ODCJ_ODCJ1_LENGTH                       0x00000001

#define _ODCJ_ODCJ2_POSITION                     0x00000002
#define _ODCJ_ODCJ2_MASK                         0x00000004
#define _ODCJ_ODCJ2_LENGTH                       0x00000001

#define _ODCJ_ODCJ4_POSITION                     0x00000004
#define _ODCJ_ODCJ4_MASK                         0x00000010
#define _ODCJ_ODCJ4_LENGTH                       0x00000001

#define _ODCJ_ODCJ8_POSITION                     0x00000008
#define _ODCJ_ODCJ8_MASK                         0x00000100
#define _ODCJ_ODCJ8_LENGTH                       0x00000001

#define _ODCJ_ODCJ9_POSITION                     0x00000009
#define _ODCJ_ODCJ9_MASK                         0x00000200
#define _ODCJ_ODCJ9_LENGTH                       0x00000001

#define _ODCJ_ODCJ11_POSITION                    0x0000000B
#define _ODCJ_ODCJ11_MASK                        0x00000800
#define _ODCJ_ODCJ11_LENGTH                      0x00000001

#define _ODCJ_w_POSITION                         0x00000000
#define _ODCJ_w_MASK                             0xFFFFFFFF
#define _ODCJ_w_LENGTH                           0x00000020

#define _CNPUJ_CNPUJ0_POSITION                   0x00000000
#define _CNPUJ_CNPUJ0_MASK                       0x00000001
#define _CNPUJ_CNPUJ0_LENGTH                     0x00000001

#define _CNPUJ_CNPUJ1_POSITION                   0x00000001
#define _CNPUJ_CNPUJ1_MASK                       0x00000002
#define _CNPUJ_CNPUJ1_LENGTH                     0x00000001

#define _CNPUJ_CNPUJ2_POSITION                   0x00000002
#define _CNPUJ_CNPUJ2_MASK                       0x00000004
#define _CNPUJ_CNPUJ2_LENGTH                     0x00000001

#define _CNPUJ_CNPUJ4_POSITION                   0x00000004
#define _CNPUJ_CNPUJ4_MASK                       0x00000010
#define _CNPUJ_CNPUJ4_LENGTH                     0x00000001

#define _CNPUJ_CNPUJ8_POSITION                   0x00000008
#define _CNPUJ_CNPUJ8_MASK                       0x00000100
#define _CNPUJ_CNPUJ8_LENGTH                     0x00000001

#define _CNPUJ_CNPUJ9_POSITION                   0x00000009
#define _CNPUJ_CNPUJ9_MASK                       0x00000200
#define _CNPUJ_CNPUJ9_LENGTH                     0x00000001

#define _CNPUJ_CNPUJ11_POSITION                  0x0000000B
#define _CNPUJ_CNPUJ11_MASK                      0x00000800
#define _CNPUJ_CNPUJ11_LENGTH                    0x00000001

#define _CNPUJ_w_POSITION                        0x00000000
#define _CNPUJ_w_MASK                            0xFFFFFFFF
#define _CNPUJ_w_LENGTH                          0x00000020

#define _CNPDJ_CNPDJ0_POSITION                   0x00000000
#define _CNPDJ_CNPDJ0_MASK                       0x00000001
#define _CNPDJ_CNPDJ0_LENGTH                     0x00000001

